Add multi-delete option for question sets
